// Задача 3 - command line arguments
// Напишете програма, която намира сумата на аргументите, подадени от командния ред.

// Програмата може да приема 3 вида аргументи от командния ред:
// целочислени аргументи в десетична бройна система, например 10, -21, 55.
// числа с плаваща запетая, например 12.5, 3.14
// Числа в шестнадесетична бройна система 0xff

// Приемете, че:
// Ако аргумент има точка в записа, то той е число с плаваща запетая
// Ако аргумент започва със 0X или 0x, то той е число записано в шестнадесетична бройна система
// В противен случай аргументът е цяло число, записано в десетична бройна система

// Използвайте функциите от стандартната библиотека за да си улесните работата по обработването на аргументите от командния ред (напр. atoi, strtof, sscanf от string.h).
// Примерно изпълнение:
// $ ./sum_cli 10 12.5 0xff -21 55 0XA 3.14
// Sum is 324.64

// Пояснение: 
// 10 + 12.5 + 0xff(255) - 21 + 55 + 0XA(10) + 3.14 = 324.64

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>



int main(int argc, char *argv[])
{
    int i;
    double sum = 0.0;
    for (int i = 1; i < argc; i++)
    {

        char* arg = argv[i];
        double num = 0.0;
        if (argv[i][0] == '0' && argv[i][1] == 'x' || argv[i][0] == '0' && argv[i][1] == 'X')
        {
            sscanf(arg,"%x",(unsigned int*)&num);
            sum += num;
        }
        else
        {
            sum += strtod(arg, NULL);
        }
    }
    printf("Sum is %.2f\n", sum);
    return 0;
}
